import sqlite3
import random

class fhl_server:
    chars = '人山风日云天水春月花心君不无一上白有中来明落秋何见下长江时知归青生夜如雨行自今去流为寒清空里在开高尽是此满色远东南与看得相前地处向西间未深子多入出万路光三年暮雪树千家飞似门烟望闲故草起事吹回别城道欲愁到海更声楼我已香独思头玉朝客同边还照几外重应好古碧游酒阳新随过北闻作半情谁红石野初五晚将老金莫马旧影醉意平松临台林气可鸟黄柳连后阴发送犹十从动当绿衣仙逢终残断浮歌叶梦共孤世晓尘河成溪复枝少九正忆龙若波楚晴关离华王问对桃分宫遥静斜露池百庭难霜亦近主竹微爱汉乡和国洞四散二方能木期坐凉留却吟夕诗曲岁待隔又然笑身逐轻度寻两使湖幽大名景川安带至暗乱泉怜惊合识翠悲小非书余暖言唯伤鹤因宿芳窗沙早登之乐转片桂峰雁涯寺语迟居常浪物觉苦火曾寂会舞紫映数岂眼摇美园文昨舟须他所湘忽卷昔殿飘虚始面寄冷经亭真含陵绝移公倚星通卧传听只神稀霞圣杨恨阁岸久便拂僧先恩依垂沈秦惜苍低迎兮鸣隐令帆疑易画急锦解镜堂皆争萧直鱼横八愿啼住塞梅堪信才双定泪罗桥怀征疏洛足帝帘佳且莲傍谢灵州丹说异死凤乘喜胡渡引于胜六立往兴悠尚吴结病怅岭伴虽本辞细田渐薄休谷女车偏条首接饮翻手容眠折教皇报用穷颜步迷彩破太燕珠口但剑船兰赏及贵弄亲劳岩目杯悬际莺夫荡雾掩净变越即想旗节昏采感学力绕以阙宜禅户夏官取杏骑齐许琴吾雷永念精猿极苑杀遍每藏俗化迹羽积素观药鸡指湿繁肠最菊收惟种潭闭其御狂负眉徒被圆臣食村任欢阔丝轮贤凝艳都根忧澄群巫消干端倾怨催屏者借羡冰惆浦遶潮径陇凌寥忘交没底荷泛荒命息巴恐销鼓洲宝内把源灯烧栖枕比弦土德势程众师黑那披郎背浅涧钓轩鬓塘携暂钟点管持缘岳李叹罢泽士七哭访角魂扫兵失遇津蜀丽泥陌峡功计曙兼盘床渭妾放赤况井举属荣蓬冥馆县宁畔叠茫漫元劝凭求侵衔郡由著霁银苔称郭朱迥竟再梁烛肯覆挂沧武骨旌淮尔洗幸升频第抱赠响盖霄必降虎澹禁限商涛泣遗旅调攀漏顾寿府院穿京昼寞恋境扬论耕壮衰咏房绮妆辉纵玄槛斋壁避厌俱诸奇仰鸿屋绣洒载战着舍荆壶朔要渚占章走遂机驿仍坛句全唱桐偶吐形邻瑞遣冬宵浓承席拜性敢富丈短禽参丛宅室蒙各旋驱尊买寸冲既就秀代营笼尺墙渔萝踏也凄试淡拟甘睡顶宴蝉贫扇候儿奉殊盛奈韵图嗟奏添礼幕词达驻母畏法芦伊滴吏骚广杜怪守音乃军冠漠钱阵醒倒笛灭杳粉蒲话张原侯字晖违历丘投良象耳总袖桑梨嵩庐惨扶阻嫌筵英瑶觅哀锁切鲜请堕兹饶袅献改封芙笙拥腊岛枯堤毛阶理襟茅笔记强并娇捧帐浩了层写迢业号杂纷檐修戍蓉斗压琼阑歇零午疾牵郊呼嘶射乌险尧忍值弹抛蘋态利庙昭志咽啸市危差蝶致驰扉除樵遮喧摧牛展养恶乍密羞冻鬼题浸界谓皎宇系末壑赋潇盈暑停滨衢布飒周柱惭旷索梧翁掌驾雄染实刀熟童受渺触灰祗坠篱潜腰潺勤弃妇峨絮雕鹿委鸾懒沟磬鬬灞蔽追服彼赐砌欺佛翼团祥窥裴存舒斯霭敛曛愧逸斾脚晨叫貌个忙威怕犬侣严炎碎表谿热殷诏血槐魄裳座固柏箫仗梯裁竞味茶诚踪弟延暝菱芜次侧济漾印瘴免果卿酌杖萦而聚亡嘉甚烦侍娥猎换省庆弥列仁聊棹暇义铺姿苏唤场助弓鳞旦祠赖钩栽岐尝宽岫托晋隅烂蕙鬟痕雅铜岑振迁崖暎泊藤邑继促渌哉涨推悟骊耀宛政或凿堆簟领浊奔益甲竿策陆乞适浑驭止辽探狼瑟夷读孙街煖偷插櫂约韶激稍摘进汀霓辇造屈鉴陶剪宗薰环贞巢栏篇鸥樽巷姓朗昆视屡炉惠寰瀑汝衡玩讵建祖护夹途友误埋凡媚认芝废郁泰邀招社巧腾鲁蘂娟皓晦岘减网织支假簇赊累锡扑巾挥翔榴续镇绪脉贪纱阿朵鼎仲融兄榭伏饥妙稻枉霑启泠体围雀苗袍埃辛陪薇透萍逼保翦宾戴钿辨等虏否拔棠岚私嫁稽箭贺滞般练符资荐瞻蹄运滩麦施佩蛾排返刺弱逝肃温梵晏涵趋打榆戏鞭洁凋夺夸惹趁戈陈勿虹彻蓝葬役鞍季旱愚置卖纤槿鸳欹迳怯闺酬屯仪史黛髻颓碍刘枫翰渠禄藻碛衫焚左慵儒履铁坟晶宠蛮羁腹右柴堦兔障廊塔唐羊逆莱谩砧妨趣农搜牖焰伯脸濯吊宦溟耸氛福刻珍错涉簪陂民绶梳纸舜冢健损润墨棋穆慰偃浴湲蓼央磨妒淹术曹缀巡矣善工注爽顷辟退旁束迤贱喷橘兽酣觞量徐虫妓籍僻瓶提萼悴律料集掷击撼剡瘦供付籁维袂鹭窟辰敌希戎胸炼匡皋汾榜谪峭睹曳卜予类尾厚魏父防质垒裙襄饭倍丰鹊笳妃蹋浣恼宋寝倦藉递穴豁虑嶂己恒缺坞谈蛟郢店餐胧荻峻飏缑逾谒骄裘怒株增氏肥樱契杉藓竺棃劲恣敲洪漳毫宰鸦软汴忠湄萤顺宣啭逶鹏婵骢翅标孰闱翳默绽庾鹃敬幷则茗截司纹猛疲妻藕惬蜂崩匹简笺坚屐活困虞让绛霏慢葛遰智徊嫩崇旭赴巅滋毒秪扃苇妖钧规呈憔梢柔埽汲饱特拆反锺龟制乾乳沉牡咸钗卫整脱隋汤悄鳌博烽渴眇裂攒习位痴峤跃蚕速沃决绵选授蛇姑拾器缨豪舆熏肉汗牧屿恰撩部溶孟坤悔衲康璧贯纪菲帷澜蒸牢联椒乔腻佐昌操秉泻配俄祇箔碑幌誓颠妍贮电沽丁榻瓮暄输吞薜格震抚芽麻浔勒匣斑囊状署摩蕉逍戒亏眷遐按伫算坏鸯颍谣扁煎略盆焉烈俯眺仞湍豫颇戟湾构剩墀沾沦执唳样超秘槎胆巨鹦费丧樯乖帽闾缥珮的厨氲沼漱扣蟾预单男漂测贼线齿顿崔旬浙稳擎铭庶讶讲毕孝筝垣议筑菖缓莎寐雏茎溅笋抽遭祝圃鸪壤徘域铅璃灼彤敷戚倏惯污霰蹉缭涕禹慈架郑棱鹧飖廓黯噪悦设涌隈宸煮森邙涂绳诵鼙荅弯耻蔓嵯淅瓦谋珊价扰加狎校舌骏娱淳拨珑啄灾痛腥览鲛阖尤牙傥拍阅忌慕雉补谏朦茂惑沐篁麝败阆鹰夭翮跎摆装冉蹙馨匠飙案葭畦吠砚曜油蔼麟沸滑仑憎迸冤抵杵熳像傲蹑幡卉叟庄闰兆赫吉匪呜砂溢鹉罪瓜阊焦姬鲸纳萋翩浆咫示姥劫亚缈葱款朽夙材辕斩赵黏邪沿炙召蟠耿握栋颂彭磴堑泓舂专谙伦纶函琉玲肝邈缅脂辈蚀匝艇羲犯淇裾骥稠沥汽墓矶闷匀媒膏揖凫刃蒂贾湛犀邦蹇族浇喻纡蒹米蔬揭治葵蹊获矜祭告棘鼠顽绡靡卓吼豆檀液蜡眸朋仆遽睿莹翡序包削麋割铸飕紧剧桡植岷溜兀冒堞耽冈倩奴殁栈霖幢刚灌帏播区怆坼祸诉警芒缕替卢禾瀛闹柘挹爵恬魅髪混艺科艰黍羸偈欣祈幔乎权卮涩突俦菡萏抟剖坊蕃迈伐窈申潘醪窦亩品救戛亮窄丞欠轸箕黎甸杪檝蒿互释缠柯寇孔拙淼拭尉耶鲤湓豹卑嵬菜派峦畅髴髣俨率怡粒茸貂徂跨琐填杰铎垅瓢贡典霸耐职褐遏朴铃勇冕务寡冀晕陟践枢荫快产恻沅臂虬凛鸠阮泗蛰崦局筹骤濑擘莽韦医备均帛具答察滟搅卒飐猜缝隙球恸羇逗窕邮班迫弘禊轴慧癖褰曈妄蠹辱害哲坡晒竭麾鹢桧挽缾蓟逃幅乏楹娃荔愤锋隼恃嵘峥烹臾缄鸭帖谐袭躅旨舫甫掖遁滔证饯粟鹄段茵鹅舸掬辜跳判娘吃惧骖蘸骇洽熙肌肤丑樊銮俊毁泸狐逞罕煦寓泾现韩芬幄陛狖嬉闽编酝琪傅俸盏庵罍镂筠淑旒扪挑涤曰纲拱茍吸羌芰酿刹泄荇帔箧驷充拘菰跻藜昧慎琢穗嫦晡较悮鏁肩箓楫祀龄嘲晞囚刮膝搔遨援刑绊检麹盗凰踯龛札俭准陷板屑稼枣薪锄稚辙躬瓯昂驴翛斫优捉诀抬梭奠赞担邺螭栗讨袁斧饰瞿姮淘叔鼍珂沫畴陲熊翘萎栊掇恍尖祷勉衙拄嗣骋附验馥敞祚穹漪丸毡桓泱辍绾蚁蘼酸吕萸旰縠谅蜜蕴窃柄敦磷愈涟徽廷考涓罥窅墅蔡魔钵莓霅杭髭掀暧缆恤扆玳肺猷享介副鸢勋狞蹀簿凶掠闪嚬聪魈琵琶颊膻狱惮雠瑚漆茱耗炀簸额谬阜忝旄尹基创患荧弊浐巳雍储梓饵枳蹰暾肆择芍税墟蓑蠡碁酷芹陀暴脊鼻劈叩拣偎掣革徼檄蕤婆鄂涸刷烁猩珰拖睨犊碾庚遑僮诺络辔阗侬觜疆胎蕨霾渊淫谗膳婿循琅番鲈鹂衾控蔷爪显碓邨嚼筋斟奸蕊晃辄恭组瑁捐醮珪漭涔漉衮瞥些酲挟捷睥针嵇荚皮盟焕峒驯跸缁苞澈涪颐沱曝给眄究鄙范黔踟畬杼豺垆笠虔研酥蕖芭罅幻脆叱凯鹓沛曷迩厉隆毳辘吁歘濡冶粲厩泬厅濩缩箨篆惕阡崆扈沓沂憩窜缙什鹗诛簧膺矫巍椀铄饿褒嘘滤麓骀嵋髯甃豸骸枭帚衬菩你奢罄弧艾诞汜训育叨亘渥瞳啾躞骝轳婚賸袜朅效敕粱铛虾煌棕蔻泷翊抗录掞藂蓄禀杲峙祓讴绩徙碣醴裛贴狭喉坂宙胥嗤监咨筐罔汨麒坦婉颗逡筒皂閟氅沤胭汞窣克驶矢畿沁瞰孕秣洮唇杞呵戾陋湟蟆嵒睢冯啻辂盐瀼驼哢渤贝飡寅项苕瞩骎啜倂蒨苟秾朓陨讼邓芷荀伸霆粮碗茆筿耒诱脑苎垢厄昙澧臼溺姚磊拈醺笥觐咒嗔蜃榼财燎拏绯赢潢棣普彰演辅酤藿雌箱喘颈舷舁飗臆昃徇憀辗酺旃孺蹈述炊枥擢壳纨狩瘼澣敝溯衍党忻航霍潏娑擅赦燃饷枪俟苜蓿帻霹榛掾伪庸箸掉廉裟袈旟攻玕韬鹘鞋鲙胶髓烬薛盥崄责蛩芸翎泼塼煞罩秩导宏粗昊铿葳亥彊隳靥嚣骐噫隘砀析炬溆潦租侠堰舻颔娜慨捎岱觌鼋队惶奕屹薮筌飓罹蟋蟀迅萌谟蛛叙毂炯曩茨嘱蕲郸邯柚荪雳鹚襜鬣砖谯盼梗划尼诈躯斛啮惚嘹浥宪痊拳疮努炭裹涎灶悉佞瞋赛槲婢剥蓦螺醅挈么遒撰耆贻式曦倘亿弩纻沮抑董诫甍嫣乙镞襦羯倪唾蕣赌嵚蜍屠疠蝴僚蔟慷滥邹舃汶滉稷瞑沣块仕橐嫔皦趾晤巩蓂祐圭厦撷愆洄庇竦岧炳讯锐蹴谑鄱鄠桨蓠奋巉冽懽鲍捣钺璞滓栉捕概聒磻绢版缚勾苓邛羹葩盲册雇炷级薤颁葺狗姜耨轧赭肢蜕抹腮谨窠坑赚汭协聆溉嶷雩厥戊俎飔栅拒谱忡譬黠股衷娉岖揽伎懊它舄裔吝抃躁姝镕询蜺摄轺誉炽遵魑笈查铢柰绅筇殚邸例泫矗诣驹袷劣挫绰妹汹淙篙跂柽鸬纯犂蒋谴颦潸骧瑕毗诮嶓棺槁皖卞逦萱尸缸课嫖仓掘眩潼麤匼茧妥抄勃橹兢徴峩姊抢嵓睛桔卦罏猴撚债脾卵骓渍竖罨袴歧繇粤瀁咤虢隰敧厓阐戢罘嗥藩刍倡缃缯刁泮椰货狄旎恢敻琯挼咬蜘鳜跪楸辩轨缴怿寤氤谊蚌谤籥镳伺统措缇鞞拓杓幂蛱兕悯晼骈驺渝翟贳磵偕闼俛脍楠菌燋鹫泯荠兜谄骞貔翱钦确爨骠茏蚤旐艘佗骆菁淤哺姹虵旻虐囗栀搴燥枿完旛薝獬剃咿卯撑翥缦绦殃骂觥葓拗撒侈痰潋甑诤荞钝砾焙审炫缟佾俾懿锵帅洋轰卤溧擒矧逋婷腐猱喝幰萄斤铓鬃靖踌蟹账译舰楣逮奖旸睇疵稔讹魁匿暌纬雒璇邅嘈呦蜻贷嵫镐伽垠粘迨曼匈鄢肘芋荜秤鹡鸰辋穑姻堵髦牍篷据鬐勗戌讥婴苒庞篲凑卸肱崎耘熨屦圉莼蛙骅笏阎仅寮猪毘粥栾湔柝哑纛瑠弗翺帜昽淬攫撞踞郄囿蓊噬辀谕坎槭舶叇叆滂筛这娲悭篮娶椿模萨剔港灿汪祢雹葫肚橤缬陕贶阕佯歊屣罳壍穟踵湮滹绥驎拊赀潾础旖酡鞘琛库舳騑靓褊纠峄飧距籞彦覃蚊愠蔚戮鳖仿甿涣畎忉浃酎淄崒昴醇桢裨腴幼轘饧祯缣咎嘿腕偻刈励馔荥榈芊邵酹赎逻枚匏燠徨晷惰嗜罚亸跋怏穉湫奚踊壕屧褥疗蜓茯椎秔蝇聋鹥签钻刳办庳畊衒砥犁朣沴槔餙绸缪赁牌嵌娩勘鸱玑芡棂殡仄勺缰绫豳聘斡咄胃棉棚拉撇羃衿甜壖芟阍挠槽坳朕啖驽罾盂蘖凸掺嗅皱瑰堠丙剜獠璈岗轼璜矰岌帟绂邕纽攸拯肇毙訇枨珥璁瀚箴舅釭帕綦烝祛缛闉禺畤黼诡硕淀辖绀塍噎斲骛囷皛黻悌陬诘鸷遘阒郴宥饔隤婺嶤滚该赓贩峣欃镝晔隶伛倜澌谠诬欤锉罟鞮槃侔饲磐猖鞚酊哂竽募逅邂窘粪讽秧楞杷枇愉揜粼悼齅燧鳣鲔镫琥珀鄜忤彝豚搏赍咍阀贬蘅鲲圄呻鸽儗锼蘗橦皙镊濮摛耦弁莅帙伍隟蜗蒜嬴叉孜痒駮馈颢麈筮濬榔笄洳荦淝酉崧淋覰柿妪庑伧漓矻伶矛斵甄丫裀慑孀橡鼯搭糵捽骡砺镆恳胯摅殂腋巇弈丱厢茜恕阃弋锷泡凹菼磕樗縆沩玫挺镌锤搘鸶垄押艋舴瘿培诰嫉沔颤菓黟猕仔咛叮癸穀钉嶪需氓臭聿飨爰竁缉洊祉跹溥徜徉愔璿摽泞喋惩揲眢孑赂叛澡吓蝼咳葡秕蹶葑蛄喂阏傞挝芥阚葆憨镰侮荃弭隲晰亟浒摵菑琰企崭媛澘沍牒颉谶揆鹜觏跌汩椠迍瀍埜笃膂澶洟隗鳏诠柁涡摈恺霈戡牂儋奁藁猗诧褚庖崿俳璅氎垞漕觱骦骕鸧桁浍沚夤罝哮栩铙硖宕纫斐澥牟愀卨殛濠槌酩邢鲵肿颕奄碌殒荤荏徬坻悸蹬蹭睐睽皤祁酪驳孽皑纺蜩挞绨旆冗洼蔗跼秽孩嗷痍督牦疟噤糊缊嘒绍螫夔宓栱颿囹惛鲊顼桴轓舠茙谭谧呀唅喃祜檗佣坰噀驮鄣禳橙觑毵靃绠蔲晻奫鬘诃蛤貅薫瞪彗戆跬樾樟壬蝗揉瓌蠢偿渟谛髽鹳腑缧烘嗾歆彴浚迭硎刊恓馁頳窍唧溘罂铘郛婀螀桀剿圜痼訾榷玺撤邽滕茹檎桦擞轝拢鲂锢纮龚诳騕罴秃鉏嗽膊筭渗恂缋陁垤憾騘瘵串潴醁唼颙缶伞赉寨溷栎墉遝硬攲蔫匆嘻嘴靸豗搦麄讳沌渎叡瞒搬媪恁壸鳯舡畜忏炁嶙斝汇惫旞躔扄粹蹁伣佑隮僭崐崘沲趚砰蓪佶诟盎糠竫技躧蟪钏幺旍濉柞绚锸葢删娼黩缵缔棼纾胪崟皪滢鶱爚菽颃醲涘兑惴眊舛艸觇崤熬囋漙痗勖翕沄睦嘤呗扼迂贲绺鞲茔舣赪巑歙喟汛胄洙刎饼趺娄篑篥粳脔蒺蜉蝣阯衽鞠琊躇柟瘢栝蛬咆攘朐匮孛涢鞅酋枻怵鳸觧员輶裯薙醯葹肮脏褕刬恙筲潨颖糁悢忺哗臻购剽鋋氍阪枸瘁殄镬韭韝狙锒呕噭迕狡黾癫洫鶂桤斥鞯籹粔硉澒淰酴珉硗耜敏奰钐颛諠獭逵憧镒跕爷崛晌婕妤跚酽蹲輧堘罽玷赜玠邃髫窝偪蚋幮殳驩惸铉赘懃嗈倬籝弼陉歔详琬鞿喔嵝岣屃檠菅牁畸骼爆溃摹翌匕舲艑俚圻箬括龊枋辚饫剸堡柑捶舐轲阓阛刓阂玦虺犇翾琭瑛荄隽磔讫柙灺垫雰橰鹈惺琤蔌懑滃昉纰褪佚儆暐蕟泚蠲椁疫壅迦匙阱缱绻箆穰忒犒瞬缲醍醐汰疼挲痹箪厘朘盻劬莪蛸铮哽袿挨捍鞬膜捞狸箜篌婪刖僵觚埘蒯埭畹兖脯评吭衅訏逊币殆欷鷃踉絪苣恽霪爣殽栲媸箑摸钥肋靺枲售铍批脐擿侪稗捩隍甓厖亨圹洑桄硙嘎拶纭弛鸑躩瓣崚瘠篾滪渼醭泙簌侄诜鼐砻拽蝠蝙孥搓靠址瀹栴灊淦杆泐垓勍廛塠楝絷捺虿撮戽霤榸蝎楂俣怖饕馀悫爻牑鹆踷儜瞢衘悛趱幛愍涳棒飚楷肾嶾霙届祲祼燑飉堙祆慝袠柎绞馘粕糟槚奂谖惋嫮苹澍蜚熠墐殪饬鼗鄀鄬龠柹蒀葐孚偲缌戺焜鹑簉鈜谲诙蛉姣赩允谆萑谥鸴棨紏橑璚俞眚恪郃鬯秬菉蓐綍廼蕡燮洹毾琚荑璠玙隩瞀翀醥谀筏皈鹒曭槠弰浉鸮榇鹍鹪钲牲慆岊澨祟浡疋燀砣叚膦甥簔鹇娈琳炮笴晁鬻僶滦黪毹滮绋徭繄箊眈籴黤腼篚剺轾剁簳蝮礧悒倢伃薨齑榞臧埿鬒疚旓儛埤锻铲巂飁苶鸹狈醿炰毅貁禖徯厕鷠欸麑羾棽魍魉嵺螯岏蓻抡冱踬螾蛭砭豕仇搢嫡笇暨陡晬黝礓胤钢燐嗢玖璨眯赡戕琨喆廨钜薏苡肄盍霔祔翣啬纩紃冏雎闵亢暍螟肖肴贿镵很踔靷滇笞蚝踣诋搒簁桷搪鶢鶋饴腿蒻惄嘏迺浈鰅鳙萃嘐弢臊溽湎怦坷霶悁狴硊岿鶵黁嗉邬莳陔璎彯胚髀柣估龌殑罤愞韲洺悰龂纂啧虻罡磹赣赑炲煤捭鳟搊琲瓃僎矿玻韂癯忪躃璺潬蘩篦毺荼弝瀯箙铤磓筼筜蓁髅髑忱纴媮瘳逑酗颒寘眹姞昞憘訚孳僜儚剌鳍劖喈醨鞙黖虱醽羖鹕筤愡鍧姨沇珙駷礐柢悖獒謇燔泜憯刜莨蜮跙矍埼噢衄邘趫蓍烜蟒艛艓毯洧溱瘀豉诅麸糢袄冁诲幈邠苢芣龆挍龉龃裆嫓龁歠瓷蟏篴钞攅秭眦睚櫜崪婑缫彷硠槱睫榰漴褫粽袒鹐骹螵霿瞽咂桕雊濞谦懔骁筚劼矟黦靴鹙鹬碇矮泅鸩郅笶繍蕬掁枍紊榝醑镮筦漦瀵啅雘鲐襋莉茉樬滁跄灀罫苻鼹跗锱泳镏瑀襞疻描黜蔾渰跧轵欧绐绉籀孱稿秸锔洚黮艗髐蹒鞨髵髬麛哄歕瓟扯箦簏蔆靮笮狻猊筁蘧窾緵嫪柂颅裒杠塸埞陴駴浄蚛锨苫墢翚蛊緉荈颣殉楢窑涴鸖姐袚擗漩峋粜矾诹哦缤蔑狷曚逓绎贰檇拦汍貉菭莠稂秫緌嶒惘叵篓倭醵绘摴蒱顚綷滫缏麏伥蕺娬憝噆澼洴碏鄏郏锥皞忸楯汧絣敭娅肓缮枰荛鲠脰铦斿栳抒盾歼嚵摭獹糜纣鹴昶饤薹颟顸靘绁揾锅搂砢懦铨嵍巏瞌瓓霂霡朏嬿澎湃幞搀阈咀轹嵲嵽峃甬螖械礿蹂蝹窸爬簦蕾暹券嶰刱杌裸诐褾慜涅藟熖棁昳嵊倨诔羔昫玢璘锽槊嫄灸僝囤聃胝胼儵圪匐匍咋玃逤伉狝膘嗄撅擉皴譀袪爞睬媱屼俏耄忿芫惣袽蜿屎釜燖飰矬瘫劭灇矹扳懵絚岈槟槅核怊霋鞑鸲牗刲筳猒堄傦缐隝煽涝嫜唁鸜趍縻疹巿郪嚢邱跑玛瑙畚蛆埒挃歏某煜挅欻鷟另笻漘箘罼焘蓹坋姡跏忩蛀镟禋氐辐廪棓酆殖爝絜咲裓呷怠懈洿抖腆葶葼繠蟢丕闿澂艅艎衖桭闩嶻愐咦跟跺骰卍份厮橄榄疕胖漯欬扔柜汁緫胞衤砆俵壹惝韪纥巽磺硫'
    # 分点，分别为0.05以上, 0.01-0.05, 0.001-0.001, 0.0001-0.001, 2*1e-5 - 1e-4, 2*1e-5以下
    splits = ((0, 13), (13, 126), (126, 1013), (1013, 2819), (2819, 4327), (4327, 5587))

    def __init__(self):
        self.said = set()               # 说过的不能再说咯
        self.said_num = 0                # 目前说过几个
        self.ch = ''                    # 字
        self.conn = sqlite3.connect('/home/wechat/wechatbot/flower.db', check_same_thread=False)
        self.cur = self.conn.cursor()
        self.scores = {} # 大家的分数，字典，key为user_id，value是list，第一个是分数，第二个是昵称

    def __del__(self):
        self.conn.close()

    # 开始，返回字
    def start(self, difficulty=''):
        if '0' <= difficulty < str(len(self.splits)):
            self.ch = fhl_server.chars[random.randint(0, self.splits[int(difficulty)][1]-1)]
        else:
            # 默认难度是medium以上
            self.ch = fhl_server.chars[random.randint(0, self.splits[2][1]-1)]
        return self.ch

    # 返回这个接的对不对
    def judge(self, verse, userid, nick) -> str:
        if self.ch in verse:
            # 防止SQL注入，需要检测一下，全是汉字才行
            if all(['\u4E00' <= c <= '\u9FA5' for c in self.ch]):
                self.cur.execute('SELECT Verse, Info FROM Poem WHERE Verse=="%s"' % verse)
                if result := self.cur.fetchone():
                    # 对了，看看说没说过
                    if verse in self.said:
                        return '%s，你玩呢？【%s】这句诗说过了，不算！' % (nick, verse)
                    else:
                        # 日后可以增加显示出处的功能
                        self.said.add(verse)
                        if userid in self.scores:
                            self.scores[userid][0] += 1
                        else:
                            self.scores[userid] = [1, nick]
                        self.said_num += 1
                        return '%s，牛逼啊！【%s】，好诗，好诗啊！' % (nick, verse)
                else:
                    return '%s，你玩呢？【%s】这也叫诗？你自己写的吧？' % (nick, verse)
            else:
                return '我们玩飞花令呢，%s，你要干啥？SQL注入吗？我不会让你得逞的！【%s】这个字符串没有进入SQL语句！' % (nick, verse)
        else:
            return '不会吧不会吧，【%s】都不包含【%s】这个字！我们玩飞花令呢，别闹！' % (verse, self.ch)

    # 游戏结束
    def end_game(self):
        # 成绩排序
        items=self.scores.items()
        backitems=[v[1] for v in items]      # 分数，昵称
        backitems.sort()

        reply = '本次共玩了%s轮，大家的成绩为：\n' % (self.said_num)
        for backitem in backitems:
            reply += '%s:%s分\n' % (backitem[1], backitem[0])
        return reply